# SQL Mini Project

## Daniel Lee
## June 27, 2018

In [2]:
import pandas as pd
from sqlalchemy import create_engine

# Create engine: engine
engine = create_engine('postgresql://postgres:pass@localhost:5432/country_club')
print(engine.table_names())

['bookings', 'members', 'facilities']

## Q1: Some of the facilities charge a fee to members, but some do not. Please list the names of the facilities that do.

In [3]:
pd.read_sql_query("""SELECT name, 
                            membercost
                        FROM facilities
                     WHERE membercost = 0""", engine)

              name  membercost
0  Badminton Court         0.0
1     Table Tennis         0.0
2    Snooker Table         0.0
3       Pool Table         0.0

## Q2: How many facilities do not charge a fee to members?

In [4]:
pd.read_sql_query("""SELECT COUNT(name)
                        FROM facilities
                    WHERE membercost = 0""", engine)

   count
0      4

## Q3: How can you produce a list of facilities that charge a fee to members, where the fee is less than 20% of the facility's monthly maintenance cost? Return the facid, facility name, member cost, and monthly maintenance of the facilities in question.

In [5]:
pd.read_sql_query("""SELECT facid, 
                            name, 
                            membercost, 
                            monthlymaintenance
                        FROM facilities
                    WHERE membercost <= 0.2 * monthlymaintenance""", engine)

   facid             name  membercost  monthlymaintenance
0      1   Tennis Court 2         5.0                 200
1      2  Badminton Court         0.0                  50
2      3     Table Tennis         0.0                  10
3      4   Massage Room 1         9.9                3000
4      5   Massage Room 2         9.9                3000
5      6     Squash Court         3.5                  80
6      7    Snooker Table         0.0                  15
7      8       Pool Table         0.0                  15

## Q4: How can you retrieve the details of facilities with ID 1 and 5? Write the query without using the OR operator.

In [6]:
pd.read_sql_query("""SELECT *
                        FROM facilities
                    WHERE facid = 1 OR facid = 5""", engine)

,facid,name,membercost,guestcost,initialoutlay,monthlymaintenance
0,1,Tennis Court 2,5.0,25.0,8000,200
1,5,Massage Room 2,9.9,80.0,4000,3000

## Q5: How can you produce a list of facilities, with each labelled as 'cheap' or 'expensive', depending on if their monthly maintenance cost is more than $100? Return the name and monthly maintenance of the facilities in question.

In [7]:
pd.read_sql_query("""SELECT name, 
                            monthlymaintenance,
                            CASE WHEN monthlymaintenance > 100 THEN 'expensive'
                                ELSE 'cheap' END AS quality
                        FROM facilities""", engine)

              name  monthlymaintenance    quality
0   Tennis Court 2                 200  expensive
1  Badminton Court                  50      cheap
2     Table Tennis                  10      cheap
3   Massage Room 1                3000  expensive
4   Massage Room 2                3000  expensive
5     Squash Court                  80      cheap
6    Snooker Table                  15      cheap
7       Pool Table                  15      cheap

## Q6: You'd like to get the first and last name of the last member(s) who signed up. Do not use the LIMIT clause for your solution.

In [8]:
pd.read_sql_query("""SELECT firstname, 
                            surname
                        FROM members
                        WHERE joindate = (SELECT MAX(joindate) FROM members)""", engine)

  firstname surname
0    Darren   Smith

## Q7: How can you produce a list of all members who have used a tennis court? Include in your output the name of the court, and the name of the member formatted as a single column. Ensure no duplicate data, and order by the member name.

In [9]:
pd.read_sql_query("""SELECT DISTINCT sub.membername, 
                            facilities.name
                        FROM facilities
                        RIGHT JOIN (SELECT b.memid, 
                                           b.facid, 
                                           CONCAT(firstname, ' ', surname) AS membername
                                        FROM bookings b
                                        RIGHT JOIN members m
                                        ON b.memid = m.memid) sub
                        ON facilities.facid = sub.facid
                        WHERE facilities.name IS NOT NULL
                        ORDER BY sub.membername""", engine)

           membername             name
0      Anna Mackenzie  Badminton Court
1      Anna Mackenzie   Massage Room 1
2      Anna Mackenzie       Pool Table
3      Anna Mackenzie    Snooker Table
4      Anna Mackenzie     Squash Court
5      Anna Mackenzie     Table Tennis
6          Anne Baker  Badminton Court
7          Anne Baker   Massage Room 1
8          Anne Baker   Massage Room 2
9          Anne Baker       Pool Table
10         Anne Baker     Squash Court
11         Anne Baker     Table Tennis
12         Anne Baker   Tennis Court 2
13       Burton Tracy  Badminton Court
14       Burton Tracy   Massage Room 1
15       Burton Tracy       Pool Table
16       Burton Tracy    Snooker Table
17       Burton Tracy     Squash Court
18       Burton Tracy     Table Tennis
19       Burton Tracy   Tennis Court 2
20       Charles Owen  Badminton Court
21       Charles Owen   Massage Room 1
22       Charles Owen   Massage Room 2
23       Charles Owen       Pool Table
24       Charles Owen    Snooker Table
25       Charles Owen     Squash Court
26       Charles Owen     Table Tennis
27       Charles Owen   Tennis Court 2
28       Darren Smith  Badminton Court
29       Darren Smith   Massage Room 1
..                ...              ...
149  Ramnaresh Sarwin    Snooker Table
150  Ramnaresh Sarwin     Squash Court
151  Ramnaresh Sarwin     Table Tennis
152  Ramnaresh Sarwin   Tennis Court 2
153        Tim Boothe  Badminton Court
154        Tim Boothe   Massage Room 1
155        Tim Boothe       Pool Table
156        Tim Boothe    Snooker Table
157        Tim Boothe     Squash Court
158        Tim Boothe     Table Tennis
159        Tim Boothe   Tennis Court 2
160        Tim Rownam  Badminton Court
161        Tim Rownam   Massage Room 1
162        Tim Rownam   Massage Room 2
163        Tim Rownam       Pool Table
164        Tim Rownam     Table Tennis
165        Tim Rownam   Tennis Court 2
166     Timothy Baker  Badminton Court
167     Timothy Baker   Massage Room 1
168     Timothy Baker       Pool Table
169     Timothy Baker     Squash Court
170     Timothy Baker     Table Tennis
171     Timothy Baker   Tennis Court 2
172       Tracy Smith  Badminton Court
173       Tracy Smith   Massage Room 1
174       Tracy Smith       Pool Table
175       Tracy Smith    Snooker Table
176       Tracy Smith     Squash Court
177       Tracy Smith     Table Tennis
178       Tracy Smith   Tennis Court 2

[179 rows x 2 columns]

## Q8: How can you produce a list of bookings on the day of 2012-09-14 which will cost the member (or guest) more than $30? Remember that guests have different costs to members (the listed costs are per half-hour 'slot'), and the guest user's ID is always 0. Include in your output the name of the facility, the name of the member formatted as a single column, and the cost. Order by descending cost, and do not use any subqueries.

In [10]:
pd.read_sql_query("""SELECT f.name, 
                            CONCAT(surname, ' ', firstname) AS name,
                            CASE WHEN b.memid = 0 THEN b.slots * f.guestcost
                            ELSE b.slots * f.membercost END AS cost
                        FROM facilities f
                        JOIN bookings b
                        ON b.facid = f.facid
                        AND LEFT(starttime, 10) = '2012-09-14'
						LEFT JOIN members m 
						ON b.memid = m.memid
						ORDER BY 3 DESC
						LIMIT 10""", engine)

             name            name   cost
0  Massage Room 2                  320.0
1  Massage Room 1                  160.0
2  Massage Room 1                  160.0
3  Massage Room 1                  160.0
4  Tennis Court 2                  150.0
5  Tennis Court 2                   75.0
6    Squash Court                   70.0
7  Massage Room 1  Farrell Jemima   39.6
8    Squash Court                   35.0
9    Squash Court                   35.0

## Q9: This time, produce the same result as in Q8, but using a subquery.

In [11]:
pd.read_sql_query("""SELECT sub.* 
                        FROM(SELECT f.name, 
                                    CONCAT(surname, ' ', firstname) AS name,
                                    CASE WHEN b.memid = 0 THEN b.slots * f.guestcost
                                         ELSE b.slots * f.membercost END AS cost
                                FROM facilities f
                                JOIN bookings b
                                ON b.facid = f.facid
                                AND LEFT(starttime, 10) = '2012-09-14'
                                LEFT JOIN members m 
                                ON b.memid = m.memid
                                ORDER BY 3 DESC) sub
                        WHERE cost > 30""", engine)

             name            name   cost
0  Massage Room 2                  320.0
1  Massage Room 1                  160.0
2  Massage Room 1                  160.0
3  Massage Room 1                  160.0
4  Tennis Court 2                  150.0
5  Tennis Court 2                   75.0
6    Squash Court                   70.0
7  Massage Room 1  Farrell Jemima   39.6
8    Squash Court                   35.0
9    Squash Court                   35.0

## Q10: Produce a list of facilities with a total revenue less than 1000. The output of facility name and total revenue, sorted by revenue. Remember that there's a different cost for guests and members!

In [12]:
pd.read_sql_query("""SELECT sub.*
                        FROM
                            (SELECT f.name,
                                SUM(CASE WHEN b.memid = 0 THEN b.slots * f.guestcost
                                ELSE b.slots * f.membercost END) AS revenue
                            FROM facilities f
                            JOIN bookings b
                            ON b.facid = f.facid
                            GROUP By f.name
                            ORDER BY revenue) sub
                        WHERE revenue < 1000""", engine)

            name  revenue
0   Table Tennis    180.0
1  Snooker Table    240.0
2     Pool Table    270.0